#include <stdio.h>
#include <stdlib.h>

int main()
{
    int a[100], n, counter = 1, max = 0, i = 0, ri; //инициализация на нужните променливи
    scanf("%d", &n); //въвеждане броя на елементите в масива
    printf("Masivut e ot %d chisla\n", n);
    if(n == 1) max = 1; //в случай, че масивът има само 1 елемент най-дългата последователност от ненамаляващи стойности е 1

        for(i = 0; i < n; i++){
            printf("a[%d] = ", i, "\n");
            scanf("%d", &a[i]); //въвеждане на числата от масива
        }
            printf("--------------------------\n");
            i = 0; //зануляване на индекса, понеже не се използва for цикъл
            while (i < n - 1){ //обхожда се масива
            if (a[i] <= a[i+1]){
            counter++; /*задава се условието, a[i] <= a[i+1], като винаги когато е вярно counter променливата се увеличава с 1
            (по този начин се разбира колко е последователността на ненамаляващи стойности на масива)*/
            }else counter = 1; //винаги когато има несъответствие броячът се занулява
            i++;
            if (max < counter) {
                max = counter; //по този начин запазваме най-дългата последователност от ненамаляващи стойности
                ri = i; //когато max=counter, това означава, че това е най-десния индекс от последователността, съответно се запазва в променливата ri
                }
            }
            int li = ri - max; //задава се стойност на левия индекс от последователността
            if(max != 1){ //ако най-дългата последователност от ненамаляващи стойности е различна от 1
                for(ri; ri > li; ri--){ //обхожда се от дясно на ляво като се започва от най-десния, до най-левия индекс
                    printf("a[%d] = %d; \n",ri, a[ri]);
                }
            }else for(i = 0; i < n; i++)
                    printf("a[%d] = %d; \n",i, a[i]); /*ако най-дългата последователност от ненамаляващи стойности
                                                        не е 1 се извеждат на екрана елементите на масива*/
    printf("Nai golqma posledovatelnost ot nenamalqvashti stoinosti = %d", max);
    return 0;
}
//Сложността на алгоритъма е O = n + (n - 1). Пресметнато е от for цикъла за въвеждане на стойности на елементите на масива и от while цикъла.(n+(n-1))
//Останалите цикли са частни случаи
